Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: This section details the public API for :class:`set` and :class:`frozenset` objects. Any functionality not listed below is best accessed using the either the abstract object protocol (including :cfunc:`PyObject_CallMethod`, :cfunc:`PyObject_RichCompareBool`, :cfunc:`PyObject_Hash`, :cfunc:`PyObject_Repr`, :cfunc:`PyObject_IsTrue`, :cfunc:`PyObject_Print`, and :cfunc:`PyObject_GetIter`) or the abstract number protocol (including :cfunc:`PyNumber_And`, :cfunc:`PyNumber_Subtract`, :cfunc:`PyNumber_Or`, :cfunc:`PyNumber_Xor`, :cfunc:`PyNumber_InPlaceAnd`, :cfunc:`PyNumber_InPlaceSubtract`, :cfunc:`PyNumber_InPlaceOr`, and :cfunc:`PyNumber_InPlaceXor`).
pl: Ten rozdział wyszczególnia publiczny sprzęg programowania z ang. - API dla kategorii przedmiotu zbioru z ang. - :class:`set` i kategorii przedmiotu zamrożonego zbioru - z ang. - :class:`frozenset`. Do dowolnych możliwości nie wyszczególnionych poniżej najlepiej odnieść się przy użyciu abstrakcyjnego protokołu przedmiotów (włączając w to :cfunc:`PyObject_CallMethod`, :cfunc:`PyObject_RichCompareBool`, :cfunc:`PyObject_Hash`, :cfunc:`PyObject_Repr`, :cfunc:`PyObject_IsTrue`, :cfunc:`PyObject_Print`, i :cfunc:`PyObject_GetIter`) lub przy użyciu abstrakcyjnego protokołu liczbowego (włączając w to :cfunc:`PyNumber_And`, :cfunc:`PyNumber_Subtract`, :cfunc:`PyNumber_Or`, :cfunc:`PyNumber_Xor`, :cfunc:`PyNumber_InPlaceAnd`, :cfunc:`PyNumber_InPlaceSubtract`, :cfunc:`PyNumber_InPlaceOr`, i :cfunc:`PyNumber_InPlaceXor`).

source: The following type check macros work on pointers to any Python object. Likewise, the constructor functions work with any iterable Python object.
pl: Następujące makropolecenia sprawdzające rodzaj przedmiotu pracują na wskaźnikach do dowolnych przedmiotów języka pytonowskiego. Podobnie, zadania konstruktorów pracjują z dowolnymi przedmiotami przechodnimi języka pytonowskiego

source: The following functions and macros are available for instances of :class:`set` or :class:`frozenset` or instances of their subtypes.
pl: Następujące zadania i makropolecenia dostępne są dla przykładów kategorii zbioru - z ang. - :class:`set` lub zbioru zamrożonego - z ang. - :class:`frozenset` lub przykładowych realizacjach ich podtypów i podkategorii.

source: The following functions are available for instances of :class:`set` or its subtypes but not for instances of :class:`frozenset` or its subtypes.
pl: Następujące zadania dostępne są dla przykładów kategorii zbioru - z ang. - :class:`set` lub jej podkategorii, ale nie dla przykładów kategorii zamrożonego zbioru - z ang. - :class:`frozenset` lub jego podkategorii.

source: Slice Objects
pl: Przedmioty wycinków

source: Common Object Structures
pl: Wspólne struktury przedmiotów

source: There are a large number of structures which are used in the definition of object types for Python. This section describes these structures and how they are used.
pl: Istnieje duża liczba struktur, które są używane przy definiowaniu rodzajów przedmiotów w języku pytonowskim. Ten rozdział opisuje te struktury i jak są one używane.

source: All Python objects ultimately share a small number of fields at the beginning of the object's representation in memory. These are represented by the :ctype:`PyObject` and :ctype:`PyVarObject` types, which are defined, in turn, by the expansions of some macros also used, whether directly or indirectly, in the definition of all other Python objects.
pl: Wszystkie przedmioty języka pytonowskiego ostatecznie współdzielą niewielką liczbę pól na początku ich reprezentacji w pamięci. Są one reprezentowane przez pola o rodzaju :ctype:`PyObject` i :ctype:`PyVarObject` które są zdefiniowane z kolei przez rozwinięcia pewnych makrodefinicji używanych także bezpośrednio lub pośrednio, w definicji wszystkich innych przedmiotów języka pytonowskiego.

source: These macros are used in the definition of :ctype:`PyObject` and :ctype:`PyVarObject`:
pl: Te makrodefinicje używane są przy definicjach :ctype:`PyObject` i :ctype:`PyVarObject`:

source: The :attr:`ml_meth` is a C function pointer. The functions may be of different types, but they always return :ctype:`PyObject\*`. If the function is not of the :ctype:`PyCFunction`, the compiler will require a cast in the method table. Even though :ctype:`PyCFunction` defines the first parameter as :ctype:`PyObject\*`, it is common that the method implementation uses a the specific C type of the *self* object.
pl: Atrybut :attr:`ml_meth` jest wskaźnikiem zadania z jęyzka C. Zadania mogą być różnych rodzajów, ale zawsze zwracają :ctype:`PyObject\*`. Jeśli zadanie nie jest :ctype:`PyCFunction`, kompilator będzie wymagał rzutowania w tabeli sposobów postępowania. Chociaż :ctype:`PyCFunction` definiuje pierwszy parametr jako :ctype:`PyObject\*`, często zdarza się, że wypełnienie sposobu postępowania używa szczególnego rodzaju z języka C wynikającego z *swojego* - z ang. - *self* przedmiotu.

source: The :attr:`ml_flags` field is a bitfield which can include the following flags. The individual flags indicate either a calling convention or a binding convention. Of the calling convention flags, only :const:`METH_VARARGS` and :const:`METH_KEYWORDS` can be combined (but note that :const:`METH_KEYWORDS` alone is equivalent to ``METH_VARARGS | METH_KEYWORDS``). Any of the calling convention flags can be combined with a binding flag.
pl: Pole :attr:`ml_flags` jest polem bitowym, które może zawierać następujące flagi.Indywidualne flagi wskazują albo konwencję wywoływania albo konwencję wiązania. Z konwencji wywoływania, tylko :const:`METH_VARARGS` i :const:`METH_KEYWORDS` mogą być mieszane (ale zauważ, że samo :const:`METH_KEYWORDS jest równoważne ``METH_VARARGS | METH_KEYWORDS``). Każda z flag konwencji wywołania może być mieszana z flagą wiążącą.

source: This is the typical calling convention, where the methods have the type :ctype:`PyCFunction`. The function expects two :ctype:`PyObject\*` values. The first one is the *self* object for methods; for module functions, it is the module object. The second parameter (often called *args*) is a tuple object representing all arguments. This parameter is typically processed using :cfunc:`PyArg_ParseTuple` or :cfunc:`PyArg_UnpackTuple`.
pl: To jest typowa konwencja wywoływania, gdzie sposoby postępowania są rodzaju :ctype:`PyCFunction`. Zadanie oczekuje dwóch wartości typu :ctype:`PyObject\*`, Pierwszą z nich jest *samo* - z ang. - *self* dla sposobów postępowania; dla zadań modułowych, jest to przedmiot modułu. Drugim parametrem (często zwanym *args*) jest przedmiot krotki reprezentujący wszystkie parametry. Ten parametr jest zwykle przetwarzany przy użyciu :cfunc:`PyArg_ParseTuple` lub :cfunc:`PyArg_UnpackTuple`.

source: Methods with these flags must be of type :ctype:`PyCFunctionWithKeywords`. The function expects three parameters: *self*, *args*, and a dictionary of all the keyword arguments. The flag is typically combined with :const:`METH_VARARGS`, and the parameters are typically processed using :cfunc:`PyArg_ParseTupleAndKeywords`.
pl: Sposoby postępowania z tymi flagami muszą być typu :ctype:`PyCFunctionWithKeywords`. Zadanie oczekuje trzech parametrów: *samego*, *argumentów*, i słownika wszystkich parametrów kluczowych. Flaga jest zwykle łączona z :const:`METH_VARARGS`, a parametry są zwykle przetwarzane używając :cfunc:`PyArg_ParseTupleAndKeywords`.

source: Methods without parameters don't need to check whether arguments are given if they are listed with the :const:`METH_NOARGS` flag. They need to be of type :ctype:`PyCFunction`. The first parameter is typically named *self* and will hold a reference to the module or object instance. In all cases the second parameter will be *NULL*.
pl: Sposoby postępowania bez parametrów nie potrzebują sprawdzać czy parametry zostały im dostarczone jeśli są one na liście z załączoną flagą :const:`METH_NOARGS`. Muszą być typu :ctype:`PyCFunction`. Pierwszy parametr jest zwyczajowo nazwany *sam* - z ang. - *self* i przechowuje odwołanie do modułu lub przykładu przedmiotu. We wszystkich przypadkach drugi parametr jest *NULL*.

source: Methods with a single object argument can be listed with the :const:`METH_O` flag, instead of invoking :cfunc:`PyArg_ParseTuple` with a ``"O"`` argument. They have the type :ctype:`PyCFunction`, with the *self* parameter, and a :ctype:`PyObject\*` parameter representing the single argument.
pl: Sposoby postępowania z pojedynczym przedmiotem jako parametrem mogą być umieszczone z flagą :const:`METH_O`, zamiast wywoływania :cfunc:`PyArg_ParseTuple` z parametrem ``"O"``. Są typu :ctype:`PyCFunction`, z parametrem *self*, i parametrem :ctype:`PyObject\*` reprezentującym pojedynczy parametr.

source: These two constants are not used to indicate the calling convention but the binding when use with methods of classes. These may not be used for functions defined for modules. At most one of these flags may be set for any given method.
pl: Te dwie stałe nie są używane do zaznaczania konwencji wywoływania, ale wiążą gdy są używane ze sposobami postępowania w rodzajach przedmiotów. Nie mogą być one używane dla zadań określonych dla modułów. Co najwyżej jedna z tych flag może być ustawiona dla dowolnego danego sposobu postępowania.

source: The method will be passed the type object as the first parameter rather than an instance of the type. This is used to create *class methods*, similar to what is created when using the :func:`classmethod` built-in function.
pl: Sposobowi postępowania zostanie przekazany przedmiot typu przedmiotu jako pierwszy parametr zamiast przykładu przedmiotu tego typu. Jest to używane aby tworzyć *sposoby postępowania rodzajów przedmiotów*, podobnie do tego, co jest tworzone przy użyciu zadania wbudowanego :func:`classmethod`.

source: The method will be passed *NULL* as the first parameter rather than an instance of the type. This is used to create *static methods*, similar to what is created when using the :func:`staticmethod` built-in function.
pl: Sposobowi postępowania zostanie przekazany parametr *NULL* jako pierwszy zamiast przykładu przedmiotu tego typu. Jest to używane aby tworzyć *statyczny sposób postępowania*, podobne do tego co tworzy się przy użyciu wbudowanego zadania :func:`staticmethod`.

source: One other constant controls whether a method is loaded in place of another definition with the same method name.
pl: Jedna pozostała stała kontroluje czy sposób postępowania jest ładowany w miejscu innej definicji o tej samej nazwie sposobu postępowania.

source: The method will be loaded in place of existing definitions. Without *METH_COEXIST*, the default is to skip repeated definitions. Since slot wrappers are loaded before the method table, the existence of a *sq_contains* slot, for example, would generate a wrapped method named :meth:`__contains__` and preclude the loading of a corresponding PyCFunction with the same name. With the flag defined, the PyCFunction will be loaded in place of the wrapper object and will co-exist with the slot. This is helpful because calls to PyCFunctions are optimized more than wrapper object calls.
pl: Sposób postępowania zostanie załadowany w miejsce istniejących definicji. Bez *METH_COEXIST*, domyślnie pomija się powtórzone definicje. Od kiedy opakowania gniazd są ładowane przed tabelą sposobów postępowania, istnienie na przykład gniazda *sq_contains* generuje opakowany sposób postępowania nazywany :meth:`__contains__` i zapobiega ładowaniu odpowiadającego zadania PyCFunction o tej samej nazwie. Ze zdefiniowaną flagą, PyCFunction zostanie załadowane w miejsce przedmiotu opakowania i będzie współistniał z gniazdem. To jest pomocne ponieważ wywołania PyCFunction są zoptymalizowane bardziej niż odwołania do przedmiotów opakowań.

source: Operating System Utilities
pl: Użytki Systemu Operacyjnego

source: System Functions
pl: Zadania systemowe

source: These are utility functions that make functionality from the :mod:`sys` module accessible to C code. They all work with the current interpreter thread's :mod:`sys` module's dict, which is contained in the internal thread state structure.
pl: To są zadania użytkowe, które czynią zadania z modułu :mod:`sys` dostępnymi dla kodu z języka C. Wszystkie pracują z obecnym słownikiem modułu :mod:`sys` wątku programu interpretującego polecenia języka pytonowskiego, który to słownik jest zawarty w wewnętrznej strukturze stanu wątku.

source: Process Control
pl: Kontrola procesów

source: Tuple Objects
pl: Przedmioty krotek.

source: Type Objects
pl: Przedmioty rodzaju

source: Perhaps one of the most important structures of the Python object system is the structure that defines a new type: the :ctype:`PyTypeObject` structure. Type objects can be handled using any of the :cfunc:`PyObject_\*` or :cfunc:`PyType_\*` functions, but do not offer much that's interesting to most Python applications. These objects are fundamental to how objects behave, so they are very important to the interpreter itself and to any extension module that implements new types.
pl: Zapewne jedną z najważniejszych struktur systemu przedmiotów języka pytonowskiego jest struktura która definiuje nowy typ: strukturę :ctype:`PyTypeObject`. Przedmioty typu mogą być obsłużone używając dowolnego zadania spośród :cfunc:`PyObject_\*` lub :cfunc:`PyType_\*`, ale nie oferują wiele w sensie tego, co mogłoby być interesujące dla większości aplikacji języka pytonowskiego. Te przedmioty są podstawowe dla tego jak zachowują się przedmioty, więc są one bardzo istotne dla samego programu interpretującego polecenia języka pytonowskiego i do dowolnego modułu rozszerzającego który określa nowe typy przedmiotów.

source: Type objects are fairly large compared to most of the standard types. The reason for the size is that each type object stores a large number of values, mostly C function pointers, each of which implements a small part of the type's functionality. The fields of the type object are examined in detail in this section. The fields will be described in the order in which they occur in the structure.
pl: Przedmioty typu przedmiotów są znacznie większe w porównaniu do większości standardowych typów. Powodem tego rozmiaru jest to, że każdy przedmiot typu przechowuje dużą liczbę wartości, w większości wskaźników zadań C, z których każda wypełnia małą część użyteczności danego typu. Pola przedmiotu typu zostaną opisane w kolejności w której pojawiają się w strukturze.

source: Typedefs: unaryfunc, binaryfunc, ternaryfunc, inquiry, intargfunc, intintargfunc, intobjargproc, intintobjargproc, objobjargproc, destructor, freefunc, printfunc, getattrfunc, getattrofunc, setattrfunc, setattrofunc, reprfunc, hashfunc
pl: Definicje typu: unaryfunc, binaryfunc, ternaryfunc, inquiry, intargfunc, intintargfunc, intobjargproc, intintobjargproc, objobjargproc, destructor, freefunc, printfunc, getattrfunc, getattrofunc, setattrfunc, setattrofunc, reprfunc, hashfunc

source: The structure definition for :ctype:`PyTypeObject` can be found in :file:`Include/object.h`. For convenience of reference, this repeats the definition found there:
pl: Definicja struktury dla :ctype:`PyTypeObject` można znaleźć w :file:`Include/object.h`. Dla wygody poręczności, powtórzona definicja znajduje się tutaj:

source: typedef struct _typeobject { PyObject_VAR_HEAD char *tp_name; /* For printing, in format "<module>.<name>" */ int tp_basicsize, tp_itemsize; /* For allocation */ /* Methods to implement standard operations */ destructor tp_dealloc; printfunc tp_print; getattrfunc tp_getattr; setattrfunc tp_setattr; void *tp_reserved; reprfunc tp_repr; /* Method suites for standard classes */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* More standard operations (here for binary compatibility) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Functions to access object as input/output buffer */ PyBufferProcs *tp_as_buffer; /* Flags to define presence of optional/expanded features */ long tp_flags; char *tp_doc; /* Documentation string */ /* call function for all accessible objects */ traverseproc tp_traverse; /* delete references to contained objects */ inquiry tp_clear; /* rich comparisons */ richcmpfunc tp_richcompare; /* weak reference enabler */ long tp_weaklistoffset; /* Iterators */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Attribute descriptor and subclassing stuff */ struct PyMethodDef *tp_methods; struct PyMemberDef *tp_members; struct PyGetSetDef *tp_getset; struct _typeobject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; long tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Low-level free-memory routine */ inquiry tp_is_gc; /* For PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* method resolution order */ PyObject *tp_cache; PyObject *tp_subclasses; PyObject *tp_weaklist; } PyTypeObject;
pl: typedef struct _typeobject { PyObject_VAR_HEAD char *tp_name; /* Dla drukowania, w formacie "<moduł>.<nazwa>" */ int tp_basicsize, tp_itemsize; /* Dla alokacji */ /* Sposoby postępowania wypełniające standardowe operacje */ destructor tp_dealloc; printfunc tp_print; getattrfunc tp_getattr; setattrfunc tp_setattr; void *tp_reserved; reprfunc tp_repr; /* Suity sposobów postępowania dla typów standardowych */ PyNumberMethods *tp_as_number; PySequenceMethods *tp_as_sequence; PyMappingMethods *tp_as_mapping; /* Wiele standardowych operacji (tutaj dla binarnej kompatybilności) */ hashfunc tp_hash; ternaryfunc tp_call; reprfunc tp_str; getattrofunc tp_getattro; setattrofunc tp_setattro; /* Zadania do dostępu do przedmiotów jako wejścia/wyjścia przestrzeni wymiany */ PyBufferProcs *tp_as_buffer; /* Flagi do definiowania obecności dodatkowych/rozszerzonych właściwości */ long tp_flags; char *tp_doc; /* ciągi znaków dokumentacji */ /* wywołanie zadania dla wszystkich dostępnych przedmiotów */ traverseproc tp_traverse; /* skasuje odniesienia do zawartych przedmiotów */ inquiry tp_clear; /* bogate porównania */ richcmpfunc tp_richcompare; /* załączanie słabych odniesień */ long tp_weaklistoffset; /* Przedmioty przechodzące */ getiterfunc tp_iter; iternextfunc tp_iternext; /* Przedmioty opisujące atrybuty i sprawy tworzenia podrodzajów */ struct PyMethodDef *tp_methods; struct PyMemberDef *tp_members; struct PyGetSetDef *tp_getset; struct _typeobject *tp_base; PyObject *tp_dict; descrgetfunc tp_descr_get; descrsetfunc tp_descr_set; long tp_dictoffset; initproc tp_init; allocfunc tp_alloc; newfunc tp_new; freefunc tp_free; /* Sposób postępowania zwalniający pamięć na niskim poziomie */ inquiry tp_is_gc; /* Dla PyObject_IS_GC */ PyObject *tp_bases; PyObject *tp_mro; /* kolejność rozwiązywania nazw sposobów postępowania */ PyObject *tp_cache; PyObject *tp_subclasses; PyObject *tp_weaklist; } PyTypeObject;

source: The type object structure extends the :ctype:`PyVarObject` structure. The :attr:`ob_size` field is used for dynamic types (created by :func:`type_new`, usually called from a class statement). Note that :cdata:`PyType_Type` (the metatype) initializes :attr:`tp_itemsize`, which means that its instances (i.e. type objects) *must* have the :attr:`ob_size` field.
pl: Struktura przedmiotu rodzaju rozszerza strukturę :ctype:`PyVarObject`. Pole :attr:`ob_size` używane jest dla typów dynamicznych (tworzonych przy użyciu :func:`type_new`, zwykle wywoływanych z deklaracji rodzaju przedmiotu). Zauważ, że :cdata:`PyType_Type` (typ przedmiotu typu - inaczej metatyp) inicjuje :attr:`tp_itemsize`, które oznacza, że jego przykłady (przedmioty typu) *muszą* mieć pole :attr:`ob_size`.

source: The remaining fields are only defined if the feature test macro :const:`COUNT_ALLOCS` is defined, and are for internal use only. They are documented here for completeness. None of these fields are inherited by subtypes.
pl: Pozostałe pola są tylko zdefiniowane jeśli makrodefinicja sprawdzenia występowania własności :const:`COUNT_ALLOCS` jest zdefiniowane, i jest tylko do wewnętrznego użytku. Są tutaj opisane dla zupełności. Żadne z tych pól nie jest dziedziczone przez podtypy.

source: Also, note that, in a garbage collected Python, tp_dealloc may be called from any Python thread, not just the thread which created the object (if the object becomes part of a refcount cycle, that cycle might be collected by a garbage collection on any thread). This is not a problem for Python API calls, since the thread on which tp_dealloc is called will own the Global Interpreter Lock (GIL). However, if the object being destroyed in turn destroys objects from some other C or C++ library, care should be taken to ensure that destroying those objects on the thread which called tp_dealloc will not violate any assumptions of the library.
pl: Zauważ też, że w programie interpretującym polecenia języka pytonowskiego z regularnym odśmiecaniem, tp_dealloc może być wywoływane z dowolnego wątku programu interpretującego polecenia języka pytonowskiego, nie tylko z wątku który stworzył przedmiot (jeśli przedmiot stanie się częścią cyklu refcount, ten cykl może być potraktowany odśmiecaniem przez zbiórkę śmieci w dowolnym wątku). Nie jest to problem dla wywołań sprzęgu języka pytonowskiego (z ang. - API), od kiedy wątek, na którym tp_dealloc jest wywoływany będzie posiadał Nadrzędną Blokadę Programu Interpretującego język pytonowski (z ang. - GIL). Jednakże, jeśli przedmiot ulegający destrukcji z kolei zniszczy przedmioty z jakiejś innej biblioteki C lub C++, powinno się zwrócić szczególną uwagę, aby niszcząc te przedmioty w wątku, który wywołał tp_dealloc nie zakłócić żadnych założeń bibliotecznych.

source: Number Object Structures
pl: Struktury przedmiotów liczbowych

source: Mapping Object Structures
pl: Struktury przedmiotów mapowania

source: Sequence Object Structures
pl: Struktury przedmiotów sekwencyjnych

source: Buffer Object Structures
pl: Struktury przedmiotów przestrzeni wymiany (z ang. - buffer)

source: The buffer interface exports a model where an object can expose its internal data.
pl: Sprzęg przestrzeni wymiany wystawia model gdzie przedmiot może wystawiać swoje wewnętrzne dane.

source: If an object does not export the buffer interface, then its :attr:`tp_as_buffer` member in the :ctype:`PyTypeObject` structure should be *NULL*. Otherwise, the :attr:`tp_as_buffer` will point to a :ctype:`PyBufferProcs` structure.
pl: Jeśli przedmiot nie wystawia na zewnątrz sprzęgu przestrzeni wymiany, wtedy jego pole :attr:`tp_as_buffer` w strukturze :ctype:`PyTypeObject` powinno być puste - z ang. - *NULL*. W przeciwnym przypadku :attr:`tp_as_buffer` będzie wskazywał na strukturę :ctype:`PyBufferProcs`.

source: Unicode Objects and Codecs
pl: Przedmioty Unikodu i Kodery/Dekodery

source: Unicode Objects
pl: Przedmioty Unikodu

source: Unicode Type
pl: Rodzaj Unikodu

source: These are the basic Unicode object types used for the Unicode implementation in Python:
pl: To są podstawowe przedmioty Unikodu używane dla wypełnienia Unikodu w języku pytonowskim:

source: Note that UCS2 and UCS4 Python builds are not binary compatible. Please keep this in mind when writing extensions or interfaces.
pl: Zauważ, że kompilacje UCS2 i UCS4 języka pytonowskiego nie są wzajemnie odpowiednie binarnie. Proszę miej to na uwadze pisząc rozszerzenia lub sprzęgi biblioteczne.

source: The following APIs are really C macros and can be used to do fast checks and to access internal read-only data of Unicode objects:
pl: Następujące sprzęgi są w rzeczywistości makropoleceniami języka C i mogą być używane do szybkich sprawdzeń i do uzyskiwania dostępu do wewnętrznych danych tylko do odczytu przedmiotów Unikodu:

source: Unicode Character Properties
pl: Własności znaków Unikodu
